import java.util.Scanner;
public class HealthCheck {
	
	public void questions(){
		Scanner sc= new Scanner(System.in);
		int a[]= new int[10];
		System.out.println("Δηλώστε αν έχετε ενα ή παραπάνω από τα παρακάτω συμπτώματα: /n (Απαντάτε με ναι ή όχι στην ερώτηση για το καθένα απο αυτά)");
		int i;
		String[] symptoms = new String[10];
		symptoms[0] = "βήχα";
		symptoms[1] = "πυρετό";
		symptoms[2] = "δύσπνοια";
		symptoms[3] = "αιφνίδια εκδήλωση ανοσμίας, αγευσίας ή δυσγευσίας";
		symptoms[4] = "διάρροια";
		symptoms[5] = "έμετο";
		symptoms[6] = "μυαλγίες";
		symptoms[7] = "καταβολή";
		symptoms[8] = "ρίγος";
		symptoms[9] = "κεφαλαλγία";
		
		for(i=0;i<10;i++){
		a[i]=FORHELP(symptoms[i],i);
		System.out.println(a[i]);
		
		}
		
	}
	public static int FORHELP(String symptom,int i){
		Scanner sc= new Scanner(System.in);
		
		System.out.print("εχετε ");
		System.out.println(symptom);
		String answer;
		do{
		answer= sc.next();
		}while(answer.equals("ναι") || answer.equals("ΝΑΙ") || answer.equals("Ναι") || answer.equals("ΟΧΙ") || answer.equals("οχι") || answer.equals("Οχι"));
    	if (answer.equals("ναι") || answer.equals("ΝΑΙ") || answer.equals("Ναι")){
    		return 1;
    	}else{
    		return 0;
    	}
    	
	}
	public String CarantineTeacher(int a[]){
		int sum=0;
		int sum1=0;
		for (int i=0;i<4;i++){
	       sum=sum+a[i];
		}
		for (int i=4;i<10;i++){
			sum1=sum1+a[i];
		}
		if (sum>0){
			System.out.print("KARANTINA KAI TEST KORONOIOY");
			return "ΚΑΡΑΝΤΙΝΑ";
		}else if (sum1>0){
			System.out.print("παρακολουθηστε την υγεια σας για εμφανιση κιαλλων συμπτωματων");
			return "ΟΧΙ ΚΑΡΑΝΤΙΝΑ";
		}else{
        	System.out.print("ειστε υγιεστατος");
        	return "ΟΧΙ ΚΑΡΑΝΤΙΝΑ";
        }
	}
	
	public String CarantineStudent(int a[]){
		int sum=0;
		int sum1=0;
		for (int i=0;i<7;i++){
	       sum=sum+a[i];
		}
		for (int i=7;i<10;i++){
			sum1=sum1+a[i];
		}
		if (sum>0){
			System.out.print("KARANTINA KAI TEST KORONOIOY");
			return "ΚΑΡΑΝΤΙΝΑ";
		}else if (sum1>0){
			System.out.print("παρακολουθηστε την υγεια σας για εμφανιση κιαλλων συμπτωματων");
			return "ΟΧΙ ΚΑΡΑΝΤΙΝΑ";
		}else{
        	System.out.print("ειστε υγιεστατος");
        	return "ΟΧΙ ΚΑΡΑΝΤΙΝΑ";
        }
	}
	
	public  String HighDanger(){
		Scanner sc=new Scanner(System.in);
		System.out.println("Η επαφη με κρουσμα ηταν στενή; ");
		System.out.print("Ως στενή επαφη ορίζεται: /n"
				+ "Οι μαθητές που ανήκουν στο ίδιο τμήμα με μαθητή που είναι επιβεβαιωμένο κρούσμα COVID-19 και συνυπήρξαν μαζί του στη σχολική τάξη κατά το 48ωρο πριν την έναρξη των συμπτωμάτων του (ή έως και 10 ημέρες μετά από αυτήν)."
				+ "Οι μαθητές που στο τμήμα τους δίδαξε συστηματικά εκπαιδευτικός που είναι επιβεβαιωμένο κρούσμα COVID-19 κατά το 48ωρο πριν την έναρξη των συμπτωμάτων του (ή έως και 10 ημέρες μετά από αυτήν).[«δίδαξε συστηματικά»: δίδαξε τουλάχιστον 2 διδακτικές ώρες μέσα στο διάστημα του 48ωρου πριν την έναρξη των συμπτωμάτων (ή έως και 10 ημέρες μετά από αυτήν)]/n "
				+ "Άτομο (μαθητής ή ενήλικας) που είχε επαφή πρόσωπο-με-πρόσωπο με επιβεβαιωμένο κρούσμα COVID-19 κατά το 48ωρο πριν την έναρξη των συμπτωμάτων του (ή έως και 10 ημέρες μετά από αυτήν) σε απόσταση < 1.5 μέτρο, για χρονικό διάστημα ≥ 15 λεπτά και χωρίς σωστή χρήση μάσκας εκ μέρους ενός από τους δυο (ή εκ μέρους και των δύο). /n"
				+ "Άτομο που είχε άμεση σωματική επαφή με επιβεβαιωμένο κρούσμα COVID-19 (με ή χωρίς συμπτώματα) κατά την περίοδο μεταδοτικότητας. /n"
				+ "Άτομο που είχε επαφή με αναπνευστικές ή άλλες σωματικές εκκρίσεις επιβεβαιωμένου κρούσματος COVID-19 (με ή χωρίς συμπτώματα) κατά την περίοδο μεταδοτικότητας χωρίς να έχουν ληφθεί τα απαραίτητα μέτρα προφύλαξης /n"
				+ "Στενή επαφή επιβεβαιωμένου κρούσματος (μαθητή ή μέλους του προσωπικού) που χρησιμοποιεί σχολικό λεωφορείο: α/ εάν το κρούσμα έκανε σωστή χρήση μάσκας στις διαδρομές που μετείχε και έγιναν κατά τις 48 ώρες πριν την έναρξη των συμπτωμάτων (ή έως και 10 ημέρες μετά από αυτήν), στενή επαφή –υπό τυπικές συνθήκες– θεωρείται κάθε άτομο που σε κάποια διαδρομή εντός αυτού του χρονικού διαστήματος καθόταν σε διπλανή θέση ή στην αντίστοιχη θέση της μπροστινής ή πίσω σειράς από τη θέση του επιβεβαιωμένου κρούσματος, β/ εάν το κρούσμα δεν έκανε σωστή χρήση μάσκας στις διαδρομές που μετείχε και έγιναν κατά τις 48 ώρες πριν την έναρξη των συμπτωμάτων (ή έως και 10 ημέρες μετά από αυτήν), θα πρέπει να γίνει ειδική εκτίμηση κινδύνου για να οριστούν οι στενές επαφές /n"
				+ "");
		String answer1= sc.next();
		if (answer1.equals("ναι") || answer1.equals("ΝΑΙ") || answer1.equals("Ναι")){
			return "ΚΑΡΑΝΤΙΝΑ";
		}else 
			return "ΟΧΙ ΚΑΡΑΝΤΙΝΑ";
        }
}
